package ru.nabuhiro.java.basic.homeworks.lesson20;

public class Main {
    public static void main(String[] args) {

    }
}
/*Описание/Пошаговая инструкция выполнения домашнего задания:
Сервер: выполняет математические вычисления: +,-,*,/
Клиент-серверное взаимодействие:

клиент подключается к серверу, получает строку с доступными мат. операциями. Отображает ее пользователю.
пользователь вводит два числа и команду в консоль
отправляется запрос на сервер, сервер выполняет вычисления, возвращает результат клиенту.
клиент отображает результат в консоль

Критерии оценки:
реализовано клиентское приложение с консольным интерфейсом взаимодействия с пользователем (1 балл)
реализовано серверное приложение (3 балла)
работа сдана на проверку (1 балл)*/