package ru.nabuhiro.java.basic.homeworks.lesson19;

public class Main {
    public static void main(String[] args) {

    }
}
/*Описание/Пошаговая инструкция выполнения домашнего задания:
Реализуйте приложение, позволяющее работать с текстовыми файлами
При старте приложения, в консоль выводится список текстовых файлов из корневого каталоге проекта
Далее программа запрашивает имя файла, с которым хочет работать пользователь
Содержимое файла выводится в консоль
Затем любую введенную пользователем строку необходимо записывать в указанный файл*/
